/**
 * 詞庫製作與校對人員
 * Henry Chan (@hfhchan)
 */

exports.currentLines = {
	"港島綫": ["堅尼地城", "香港大學", "西營盤", "上環", "中環", "金鐘", "灣仔", "銅鑼灣", "天后", "炮台山", "北角", "鰂魚涌", "太古", "西灣河", "筲箕灣", "杏花邨", "柴灣"],
	"南港島綫": ["金鐘", "海洋公園", "黃竹坑", "利東", "海怡半島"],
	"觀塘綫": ["黃埔", "何文田", "油麻地", "旺角", "太子", "石硤尾", "九龍塘", "樂富", "黃大仙", "鑽石山", "彩虹", "九龍灣", "牛頭角", "觀塘", "藍田", "油塘", "調景嶺"],
	"荃灣綫": ["中環", "金鐘", "尖沙咀", "佐敦", "油麻地", "旺角", "太子", "深水埗", "長沙灣", "荔枝角", "美孚", "荔景", "葵芳", "葵興", "大窩口", "荃灣"],
	"將軍澳綫": ["北角", "鰂魚涌", "油塘", "調景嶺", "將軍澳", "坑口", "寶琳", "康城"],
	"東涌綫": ["香港", "九龍", "奧運", "南昌", "荔景", "青衣", "東涌", "欣澳", "迪士尼"],
	"迪士尼綫": ["欣澳", "迪士尼"],
	"東鐵綫": ["紅磡", "旺角東", "九龍塘", "大圍", "沙田", "火炭", "馬場", "大學", "大埔墟", "太和", "粉嶺", "上水", "落馬洲", "羅湖"],
	"屯馬綫": ["烏溪沙", "馬鞍山", "恆安", "大水坑", "石門", "第一城", "沙田圍", "車公廟", "大圍", "顯徑", "鑽石山", "啟德", "宋皇臺", "土瓜灣", "何文田", "紅磡", "尖東", "柯士甸", "南昌", "美孚", "荃灣西", "錦上路", "元朗", "朗屏", "天水圍", "兆康", "屯門"],
	"機場快綫": ["香港", "九龍", "青衣", "機場", "博覽館"],
};

exports.currentStations = Object.values(exports.currentLines).flat();

exports.xrl = {
	"高速鐵路": ["香港西九龍", "西九龍"],
};

exports.previousLines = {
	"西鐵綫": ["紅磡", "尖東", "柯士甸", "南昌", "美孚", "荃灣西", "錦上路", "元朗", "朗屏", "天水圍", "兆康", "屯門"],
	"馬鐵綫": ["烏溪沙", "馬鞍山", "恆安", "大水坑", "石門", "第一城", "沙田圍", "車公廟", "大圍"],
};

exports.kcrNames = [
	"東鐵", "西鐵", "馬鐵",
	"九廣東鐵", "九廣西鐵",
];

exports.mtrProjects = [
	"修正早期系統",
	"兩鐵合併",
	"將軍澳南支綫",
	"尖沙咀支線",
	"九龍南綫",
	"港島綫西延",
	"觀塘綫延綫",
	"沙中綫",
];

exports.mtrBuildings = {
	"車廠": [
		"何東樓車廠",
		"九龍灣車廠",
		"荃灣車廠",
		"柴灣車廠",
		"小蠔灣車廠",
		"將軍澳車廠",
		"八鄉車廠",
		"大圍車廠",
		"黃竹坑車廠",
		"屯門車廠",
	],
	"列車停放處": [
		"紅磡列車停放處",
		"石崗列車停放處",
	],
	"巴士車廠": [
		"屯門巴士廠",
		"大埔巴士廠",
		"洪水橋巴士廠",
	],
	"臨時車廠": [
		"西灣河臨時車廠",
		"美孚臨時車廠",
	],
	"列車": [
		"港鐵市區綫現代化列車",
		"港鐵迪士尼綫現代化列車",
		"港鐵市區綫韓製列車",
		"港鐵市區綫中國製列車",
		"港鐵南港島綫中國製列車",
		"港鐵市區綫願景列車",
		"港鐵中車四方電動列車",
		"港鐵機場鐵路列車",
		"港鐵東涌綫韓製列車",
		"港鐵機場鐵路願景列車",
		"港鐵中期翻新列車",
		"港鐵近畿川崎列車",
		"港鐵東鐵綫現代列車",
		"港鐵屯馬綫中國製列車",
		"港鐵動感號高速電動列車",
	],
};
